# Задание 1

name1 = 12
name2 = 'abc'
print(name1)
print(name2)

ask_number = int(input('Введите число: '))
ask_word = input('Введите слово: ')
print(ask_number)
print(ask_word)
